import React from "react";
import { Link } from "react-router-dom";

const PlatformList = () => {
  return (
    <div className="navbar__row">
      <ul className="navbar__row-list navbar-list">
        <li className="navbar-list__item">
          <Link to="#" className="navbar-list__link">
            <div className="navbar-list__icon">
              <svg
                width="16"
                height="19"
                viewBox="0 0 16 19"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M0 18.5V7.50671L8 0.5L16 7.50671V18.5H10V12.4597H6V18.5H0Z"
                  fill="white"
                />
              </svg>
            </div>
            Главная
          </Link>
        </li>
        <li className="navbar-list__item">
          <Link to="#" className="navbar-list__link">
            <div className="navbar-list__icon">
              <svg
                width="16"
                height="19"
                viewBox="0 0 16 19"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M13.615 7.06406C15.1323 8.21315 16 9.62209 16 11.5544C16 15.58 12.4133 18.75 8.0115 18.75C3.60573 18.75 0 15.5778 0 11.5544C0 9.3385 0.547583 7.96903 2.15502 5.69275C2.66365 4.97248 3.89867 5.23478 3.99436 6.08341C4.08034 6.84594 4.34435 7.49502 4.729 7.99265C4.47244 5.30371 5.80372 2.27961 9.08631 0.842917C9.84629 0.510299 10.6943 1.12226 10.4966 1.86058C9.98409 3.77401 10.5121 4.80343 11.8924 5.91241C11.926 5.93946 12.098 6.05078 12.3254 6.19801C12.7373 6.46465 13.3311 6.84907 13.615 7.06406ZM2.62075 8.64862C2.33897 9.22385 2 9.91585 2 11.5544C2 14.5771 4.70107 16.9534 8.0115 16.9534C11.3159 16.9534 14 14.5812 14 11.5544C14 10.204 13.4246 9.26983 12.3258 8.43765C12.1524 8.30629 11.7458 8.04109 11.3632 7.79148C11.0014 7.55546 10.6609 7.33337 10.559 7.25153C9.23392 6.18684 8.4238 5.05308 8.31376 3.54127C7.64377 4.12797 6.10424 5.95189 6.97198 9.5615C7.1065 10.1211 6.6318 10.6494 5.99451 10.6494C4.73006 10.6494 3.48016 9.78075 2.71627 8.45103C2.68562 8.51618 2.65357 8.58161 2.62075 8.64862Z"
                  fill="#fff"
                />
              </svg>
            </div>
            В тренде
          </Link>
        </li>
        <li className="navbar-list__item">
          <Link to="#" className="navbar-list__link">
            <div className="navbar-list__icon">
              <svg
                width="18"
                height="18"
                viewBox="0 0 18 18"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M3.9056 1C3.9056 0.447715 4.35471 0 4.901 0H12.9102C13.4599 0 13.9056 0.443865 13.9056 1C13.9056 1.55228 13.4565 2 12.9102 2H4.901C4.35125 2 3.9056 1.55614 3.9056 1ZM0.0101027 8.0949L0.811023 16.1041C0.917267 17.1665 1.83603 18 2.90122 18H14.91C15.9712 18 16.8943 17.1632 17.0002 16.1041L17.8011 8.0949C17.9152 6.95379 17.0495 6 15.9047 6H1.90647C0.759323 6 -0.103812 6.95576 0.0101027 8.0949ZM2.01101 8.00421L15.7998 8.0079L14.9056 16H2.9056L2.01101 8.00421ZM2.90122 3C2.35555 3 1.9056 3.44772 1.9056 4C1.9056 4.55614 2.35136 5 2.90122 5H14.91C15.4557 5 15.9056 4.55228 15.9056 4C15.9056 3.44386 15.4598 3 14.91 3H2.90122Z"
                  fill="#fff"
                />
              </svg>
            </div>
            Подписки
          </Link>
        </li>
      </ul>
    </div>
  );
};

export default PlatformList;
